import React from "react";
import '../style/home.css';
class Home extends React.Component{

    render(){
        return(
    <div id="main_body">
      <h1>Опис:</h1>
      <p>Цей сайт був розроблений,як виконання практичної 3 та 4 з курсу "Візуалізація данних". 
        Відповідно до цього він поділений на сегменти ("Практична 3" та "Практична 4").
        Кожна із них теж має свій поділ для збереження максимальної зрозумілості та зменшення густини інформації.
      </p>
      <p>Сегмент <strong>"Практична 3"</strong> умовно представлений наступними сторінками:</p>
        <ol>
          <li><strong>Домінуюча релігія</strong>: домінантна релігія у 2010 році за країнами світу.</li>
          <li><strong>Зміна кількості християн</strong>: різниця між кількістю християн у 2010 та 2050 роках за країнами світу.</li>
          <li><strong>Відсоток не афілійованих людей</strong>: кількість людей, не афілійованих з жодною релігією у 2010 році за країнами світу</li>
          <li><strong>Відсоток мусульман</strong>: частка мусульман у 2010 році за країнами світу</li>
        </ol>
        <p>Біля кожної карти можна побачити пояснення її використання та аналіз отриманих результатів</p>
        <p>Сегмент <strong>"Практична 4"</strong> умовно представлений сторінкою <strong>Практична 4</strong></p>
      <p><strong>Автор: Казан Юрій</strong></p>
    </div>)
    }
}
export default Home;