import React from "react";
import '../style/home.css';
class Home extends React.Component{

    render(){
        return(
    <div id="main_body">
      <h1>Опис:</h1>
      <p>Цей сайт був розроблений,як виконання практичної 3 та 4 з курсу "Візуалізація данних". 
        Відповідно до цього він поділений на сторінки ("Практична 3" та "Практична 4").
        Кожна із них теж має свій поділ для збереження максимальної зрозумілості та зменшення густини інформації.
      </p>
      <p>Сторінка <strong>"Практична 3"</strong> містить підсторінки,що відповідають на питання практичної,а саме:</p>
        <ol>
          <li>Домінантна релігія у 2010 році за країнами світу.</li>
          <li>Різниця між кількістю християн у 2010 та 2050 роках за країнами світу.</li>
          <li>Кількість людей, не афілійованих з жодною релігією у 2010 році за країнами світу</li>
          <li>Частка мусульман у 2010 році за країнами світу</li>
        </ol>
        <p>Біля кожної карти можна побачити пояснення її використання та аналіз отриманих результатів</p>
      <p><strong>Автор: Казан Юрій</strong></p>
    </div>)
    }
}
export default Home;