import React from "react";
import '../style/home.css';
import BubbleChart from "../charts/BubbleChart";
class Legendary extends React.Component{

    render(){
        return(
    <div id="main_body">
      <h1>Опис сторінки:</h1>
      <p>Ця сторінка була розроблена для більше детального аналізу типів покемонів. <br/>
          Загалом є 18 різних типів і кожен із них відображає певну властивість,але не всі з них логічно відповідають типу.<br/>
          Розглянемо деякі такі моменти,що видимі із візуалізації <br/>
          <ul>
              <li>
                  Як бачимо найвища атака у драконів (цей тип містить найбільшу кількість легендарних і псевдо-легендарних тому їх показники такі високі)
              </li>
              <li>
                  Наступну сходинку по силі атаки займає Бойовий тип (Fighting),який природньо володіє невисокими показниками захистів.
              </li>
              <li>
                  Найслабший в плані атаки Fairy тип. Ситуація із Спеціальною атакою трохи краща,але все ж низька.
              </li>
              <li>
                  Психічний тип (Psychic)займає першість у Спеціальній атаці.
              </li>
              <li>
                  Трійка найшвидших це Літаючий тип, Дракони та Електричний (причому Електричний на другому місці,хоча із логіки Струм швидший ніж Політ)
              </li>
              <li>
                  Найбільшим захистом володіє Сталевий тип. Проте він володіє низькою швидкістю та помірно невисокими атаками.
              </li>
              <li>
                  Fairy тип займає перше місце в плані Спеціального захисту. (Проте відставання Психічного дуже незначне).
              </li>
          </ul>
      </p>
      <p>Ця сторінка була розроблена як візуалізація балансу. Як бачимо, типи сильні у одній сфері показують середні,а то і слабкі результати в іншій. Разом із балансом типів це створює стабільну атмосферу.</p>
        <BubbleChart/>
    </div>)
    }
}
export default Legendary;