import React from "react";
import '../style/home.css';
import BubbleChart from "../charts/LegendBubble";
import LegendToType from "../charts/LegendToType";
import PseudoLegendToType from "../charts/PseudoLegendToType";
class NewLeg extends React.Component{

    render(){
        return(
    <div id="main_body">
      <h1>Опис сторінки:</h1>
      <p>Ця сторінка була розроблена ля того,щоб дати відповідь на питання "Що робить покемона легендарним?" <br/>
          Перші три графіки показують те,що розміри такі як вага чи зріст не впливають на відповідь<br/>
      </p>
      <BubbleChart/>
      <p>
          Наступне по чому можна було б визначити легенд (крім очевидно що характеристик, але тут ми намагаємося встановити кореляцію із іншими данними) це тип. <br/>
      </p>
      <div className="chart_holder">

          <LegendToType/>
      <PseudoLegendToType/>
      <ul>
          <li>
            Основні типи,які вирізняються це дракони та Психічний тип. Всі інші здебільшого збалансовані.
          </li>
          <li>
            Також із цієї візуалізації можна сказати,що тип теж не показник легендарності.
          </li>
          <li>
            Стосовно псевдо-легеднарних ситуація аналогічна,проте розподіл більш рівномірний
          </li>
          <li>
            У статистиці був використаний лише основний тип.
          </li>
      </ul>
      </div>
      <p>Як наслідок,бачимо,що легендарність розповсюджується більш випадковим чином. На неї не впливає ні лінійні розміри ні тип.<br/>
         Відповідно,бачимо,що згідно даних результатів жодної кореляції між побічними характеристиками немає.
      </p>
    </div>)
    }
}
export default NewLeg;